Repository: sirburuslan/fechat
Catalog: api/Resources/Strings.*.resx
Languages: ro

# NoTokenFound
source: The access token was not found.
ro: Tokenul de acces nu a fost găsit.

# TokenNoValid
source: The access token is not valid.
ro: Indicatorul de acces nu este valid.

# PleaseEnterPassword
source: Please, enter a password.
ro: Vă rugăm să introduceți o parolă.

# PleaseEnterRepeatPassword
source: Please, repeat the password.
ro: Vă rugăm să repetați parola.

# PasswordRepeatPasswordNotMatch
source: Password and repeat password do not match.
ro: Parola și parola repetată nu se potrivesc.

# PasswordRequired
source: The password is required.
ro: Parola este necesară.

# PasswordLength
source: The password should have a length between 6 and 20 characters.
ro: Parola trebuie să aibă o lungime între 6 și 20 de caractere.

# PasswordNoSpaces
source: The password shouldn't contain empty spaces.
ro: Parola nu trebuie să conțină spații goale.

# PasswordWasSaved
source: The password was saved successfully.
ro: Parola a fost salvată cu succes.

# PasswordWasNotSaved
source: The password was not saved successfully.
ro: Parola nu a fost salvată cu succes.

# PasswordWasChanged
source: The password was changed successfully.
ro: Parola a fost schimbată cu succes.

# PasswordWasNotChanged
source: The password was not changed successfully.
ro: Parola nu a fost schimbată cu succes.

# EmailRequired
source: The email address is required.
ro: Adresa de e-mail este obligatorie.

# EmailNotValid
source: Please enter a valid email address.
ro: Vă rugăm să introduceți o adresă de e-mail validă.

# EmailFound
source: The email is already in use in our sistem.
ro: E-mailul este deja utilizat în sistemul nostru.

# EmailNotFound
source: The email was not found in our sistem.
ro: E-mailul nu a fost găsit în sistemul nostru.

# IncorrectEmailPassword
source: The email or password is not correct.
ro: E-mailul sau parola nu sunt corecte.

# AccountCreated
source: The account was created successfully.
ro: Contul a fost creat cu succes.

# AccountNotCreated
source: The account was not created successfully.
ro: Contul nu a fost creat cu succes.

# AccountNotFound
source: The member was not found.
ro: Membrul nu a fost găsit.

# SuccessSignIn
source: You have successfully signed in.
ro: V-ați conectat cu succes.

# NoValidNumber
source: Invalid data type for this field.
ro: Tip de date nevalid pentru acest câmp.

# NoOptionsFound
source: No options were found.
ro: Nu au fost găsite opțiuni.

# NoPermissionsForAction
source: You do not have permission to perform this action.
ro: Nu aveți permisiunea de a efectua această acțiune.

# MembersSettingsUpdated
source: The settings were updated successfully.
ro: Setările au fost actualizate cu succes.

# MembersSettingsNotUpdated
source: The settings were not updated successfully.
ro: Setările nu au fost actualizate cu succes.

# NoAllowedSpecialChars
source: Special characters are not allowed.
ro: Caractere speciale nu sunt permise.

# WebsiteNameLong
source: Website name too long.
ro: Numele site-ului web este prea lung.

# ErrorOccurred
source: An error has occurred.
ro: A apărut o eroare.

# NoFileUploaded
source: The file was not uploaded correctly.
ro: Fișierul nu a fost încărcat corect.

# NoValidFile
source: The file is not valid.
ro: Fișierul nu este valid.

# NoValidFormat
source: The uploaded image does not have a supported format.
ro: Imaginea încărcată nu are un format acceptat.

# NoStorageSelected
source: No default storage selected.
ro: Niciun spațiu de stocare prestabilit selectat.

# StorageNotFound
source: The storage class was not found.
ro: Clasa de stocare nu a fost găsită.

# UrlNotValid
source: The url is not valid.
ro: Adresa URL nu este validă.

# UrlNotValid2
source: The value must be a string or null.
ro: Valoarea trebuie să fie un șir sau nulă.

# UrlLong
source: The url is too long.
ro: Adresa URL este prea lungă.

# ImageTooBig
source: The image size is too large.
ro: Dimensiunea imaginii este prea mare.

# AnalyticsCodeLong
source: The analytics code is too long.
ro: Codul de analiză este prea lung.

# SmtpProtocolLong
source: Smtp protocol is too long.
ro: Protocolul Smtp este prea lung.

# SmtpHostLong
source: Smtp host is too long.
ro: Gazda SMS este prea lungă.

# SmtpPortLong
source: Smtp port is too long.
ro: Portul SMS este prea lung.

# SmtpUsernameLong
source: Smtp username too long.
ro: Nume de utilizator SMS prea lung.

# SmtpPasswordLong
source: Smtp password too long.
ro: Parola SMS prea lungă.

# SmtpProtectionLong
source: Smtp protection is not correct.
ro: Protecția SMS nu este corectă.

# PayPalClientIdLong
source: PayPal client id too long.
ro: Idul clientului PayPal prea lung.

# PayPalClientSecretLong
source: PayPal client secret too long.
ro: Secretul clientului PayPal prea lung.

# FirstNameLong
source: First name is too long.
ro: Prenumele este prea lung.

# LastNameLong
source: Last name is too long.
ro: Numele de familie este prea lung.

# EmailLong
source: Email is too long.
ro: E-mailul este prea lung.

# NoMembersFound
source: No members were found.
ro: Niciun membru nu a fost găsit.

# MemberWasDeleted
source: The member was deleted successfully.
ro: Membrul a fost șters cu succes.

# MemberWasNotDeleted
source: The member was not deleted successfully.
ro: Membrul nu a fost șters cu succes.

# AdministratorCanNotDeleteAccount
source: The administrator can't delete their account.
ro: Administratorul nu își poate șterge contul.

# AdministratorCanNotUpdateRole
source: The administrator can't change their role.
ro: Administratorul nu își poate schimba rolul.

# MemberPhoneLong
source: Member phone is too long.
ro: Telefonul membrului este prea lung.

# MemberLanguageLong
source: The language word is too long.
ro: Cuvântul în limbă este prea lung.

# MemberIdRequired
source: Member Id is required.
ro: Idul de membru este necesar.

# MemberUpdated
source: Member data was updated successfully.
ro: Datele membrilor au fost actualizate cu succes.

# MemberNotUpdated
source: Member data was not updated successfully.
ro: Datele membrilor nu au fost actualizate cu succes.

# MemberPhotoUpdated
source: The profile photo was updated successfully.
ro: Fotografia de profil a fost actualizată cu succes.

# MemberPhotoNotUpdated
source: The profile photo was not updated successfully.
ro: Fotografia de profil nu a fost actualizată cu succes.

# IncorrectPage
source: The page value is incorrect.
ro: Valoarea paginii este incorectă.

# IncorrectRole
source: The role value is incorrect.
ro: Valoarea rolului este incorectă.

# PlanNameLong
source: Plan name is too long.
ro: Numele planului este prea lung.

# PlanCreated
source: Plan was created successfully.
ro: Planul a fost creat cu succes.

# PlanNotCreated
source: Plan was not created successfully.
ro: Planul nu a fost creat cu succes.

# PlanWasDeleted
source: Plan was deleted successfully.
ro: Planul a fost șters cu succes.

# PlanWasNotDeleted
source: Plan was not deleted successfully.
ro: Planul nu a fost șters cu succes.

# NoPlansFound
source: No plans were found.
ro: Nu au fost găsite planuri.

# PlanNotFound
source: The plan was not found.
ro: Planul nu a fost găsit.

# PlanUpdated
source: Plan data was updated successfully.
ro: Datele planului au fost actualizate cu succes.

# PlanNotUpdated
source: Plan data was not updated successfully.
ro: Datele planului nu au fost actualizate cu succes.

# PlanPriceLong
source: Plan price is too long.
ro: Prețul planului este prea lung.

# PlanCurrencyLong
source: Plan currency is too long.
ro: Moneda planului este prea lungă.

# NoRestrictionsFound
source: No restrictions were found.
ro: Nu au fost găsite restricții.

# TooManyWebsites
source: Maximum number of allowed websites is 50.
ro: Numărul maxim de site-uri web permise este de 50.

# WebsitesRestrictionWrongValue
source: The websites restriction value should be numeric.
ro: Valoarea restricției site-urilor web ar trebui să fie numerică.

# SupportedValueShouldBe
source: Value must be between [min] and [max].
ro: Valoarea trebuie să fie între [min] și [max].

# PlanRestrictionsUpdated
source: The plan's restrictions were saved successfully.
ro: Restricțiile planului au fost salvate cu succes.

# PlanRestrictionsNotUpdated
source: The plan's restrictions were not saved successfully.
ro: Restricțiile planului nu au fost salvate cu succes.

# PlanFeaturesUpdated
source: The plan's features were saved successfully.
ro: Funcțiile planului au fost salvate cu succes.

# PlanPriceNotValid
source: The plan's price is not valid.
ro: Prețul planului nu este valid.

# NoFeaturesFound
source: No features were found.
ro: Nu au fost găsite caracteristici.

# ResetCodeLong
source: The reset code is too long.
ro: Codul de resetare este prea lung.

# ResetCodeWasSent
source: The password reset code has been sent to your registered email address.
ro: Codul de resetare a parolei a fost trimis la adresa dvs. de e-mail înregistrată.

# ResetCodeRequestedAlready
source: The reset code was requested recently. Please try again after 5 minutes.
ro: Codul de resetare a fost solicitat recent. Vă rugăm să încercați din nou după 5 minute.

# ResetCodeNotvalid
source: The reset code is not valid.
ro: Codul de resetare nu este valid.

# ResetCodeExpired
source: The reset code has expired.
ro: Codul de resetare a expirat.

# ResetCodeMissing
source: The reset code is missing.
ro: Codul de resetare lipsește.

# ChangesSaved
source: The changes were saved successfully.
ro: Modificările au fost salvate cu succes.

# ChangesNotSaved
source: The changes were not saved successfully.
ro: Modificările nu au fost salvate cu succes.

# WebsiteSaved
source: The website was saved successfully.
ro: Site-ul web a fost salvat cu succes.

# WebsiteNotSaved
source: The website was not saved successfully.
ro: Site-ul web nu a fost salvat cu succes.

# WebsiteNotFound
source: The website was not found.
ro: Site-ul web nu a fost găsit.

# WebsiteAlreadySaved
source: The website is already saved.
ro: Site-ul web este deja salvat.

# DomainLong
source: The website domain is too long.
ro: Domeniul site-ului web este prea lung.

# WebsiteNameRequired
source: The website name is required.
ro: Numele site-ului este obligatoriu.

# WebsiteUrlRequired
source: The website url is required.
ro: Adresa URL a site-ului este obligatorie.

# NoWebsitesFound
source: No websites were found.
ro: Nu au fost găsite site-uri web.

# WebsiteWasDeleted
source: The website was deleted successfully.
ro: Site-ul web a fost șters cu succes.

# WebsiteWasNotDeleted
source: The website was not deleted successfully.
ro: Site-ul web nu a fost șters cu succes.

# WebsiteWasUpdated
source: The website was updated successfully.
ro: Site-ul web a fost actualizat cu succes.

# WebsiteWasNotUpdated
source: The website was not updated successfully.
ro: Site-ul web nu a fost actualizat cu succes.

# ChatWasUpdated
source: The chat was updated successfully.
ro: Chat-ul a fost actualizat cu succes.

# ChatWasNotUpdated
source: The chat was not updated successfully.
ro: Chatul nu a fost actualizat cu succes.

# MessageLong
source: The message is too long.
ro: Mesajul este prea lung.

# ThreadSecretLong
source: Thread secret is too long.
ro: Secretul firului de discuție este prea lung.

# ThreadSecretMissing
source: Thread secret is missing.
ro: Secretul firului lipsește.

# ThreadNotCreated
source: The thread was not created successfully.
ro: Firul nu a fost creat cu succes.

# ThreadNotFound
source: The thread was not found.
ro: Firul nu a fost găsit.

# MessageCreated
source: The message was created successfully.
ro: Mesajul a fost creat cu succes.

# MessageNotCreated
source: The message was not created successfully.
ro: Mesajul nu a fost creat cu succes.

# WebsiteIdMissing
source: The website id is missing.
ro: Idul site-ului lipsește.

# NoMessagesFound
source: No messages were found.
ro: Nu au fost găsite mesaje.

# MessageTooShort
source: The message is too short.
ro: Mesajul este prea scurt.

# MessageAttachmentSaved
source: The message attachment was saved successfully.
ro: Atașarea mesajului a fost salvat cu succes.

# MessageAttachmentNotSaved
source: The message attachment was not saved successfully.
ro: Atașarea mesajului nu a fost salvat cu succes.

# TooManyImages
source: A message could have up to 3 images attached.
ro: Un mesaj poate avea până la 3 imagini atașate.

# ThreadWasDeleted
source: The thread was deleted successfully.
ro: Firul a fost șters cu succes.

# ThreadWasNotDeleted
source: The thread was not deleted successfully.
ro: Firul nu a fost șters cu succes.

# ThreadIdMissing
source: The thread id parameter is missing.
ro: Parametrul id-ul firului lipsește.

# NoThreadsFound
source: No threads were found.
ro: Nu s-au găsit fire de discuții.

# NoPermissionsThisThread
source: You have no permissions to send messages in this thread.
ro: Nu aveți permisiuni de a trimite mesaje în acest fir.

# AccessTokenThreadIdMissing
source: Access token and thread id are missing.
ro: Lipsesc simbolul de acces și ID-ul firului.

# GuestNameLong
source: Your name should have a length between 1 and 50 characters.
ro: Numele dvs. trebuie să aibă o lungime între 1 și 50 de caractere.

# GuestNotCreated
source: The guest was not created successfully.
ro: Invitatul nu a fost creat cu succes.

# ChatDisabled
source: The chat is disabled for this website.
ro: Chatul este dezactivat pentru acest site.

# ChatIsDisabled
source: The chat is disabled.
ro: Chat-ul este dezactivat.

# ChatHeaderLong
source: The chat header is too long.
ro: Antetul de chat este prea lung.

# PayPalNotConfigured
source: PayPal is not configured.
ro: PayPal nu este configurat.

# PayPalTokenMissing
source: PayPal access token wasn't generated successfully.
ro: Tokenul de acces PayPal nu a fost generat cu succes.

# PayPalPriceNotValid
source: The plan price is not valid.
ro: Prețul planului nu este valid.

# PayPalCurrencyNotValid
source: The plan currency is not valid.
ro: Moneda planului nu este validă.

# PayPalProductWasNotSaved
source: The paypal product was not saved successfully.
ro: Produsul paypal nu a fost salvat cu succes.

# PayPalPlanWasNotSaved
source: The paypal plan was not saved successfully.
ro: Planul paypal nu a fost salvat cu succes.

# NoMetaFound
source: No meta were found.
ro: Nu a fost găsit niciun meta.

# NoPaymentsMethodsAvailable
source: No payments methods were found.
ro: Nu au fost găsite metode de plată.

# PaymentSourceNotValid
source: The payment source is not valid.
ro: Sursa de plată nu este validă.

# OrderIdNotValid
source: The order id is not valid.
ro: ID-ul comenzii nu este valid.

# SubscriptionIdNotValid
source: The subscription id is not valid.
ro: Idul abonamentului nu este valid.

# SubscriptionNotFound
source: The subscription was not found.
ro: Abonamentul nu a fost găsit.

# SubscriptionCreated
source: Subscription was created successfully.
ro: Abonamentul a fost creat cu succes.

# SubscriptionNotCreated
source: Subscription was not created successfully.
ro: Abonamentul nu a fost creat cu succes.

# SubscriptionUpdated
source: Subscription was updated successfully.
ro: Abonamentul a fost actualizat cu succes.

# SubscriptionNotUpdated
source: Subscription was not updated successfully.
ro: Abonamentul nu a fost actualizat cu succes.

# NoSubscriptionsFound
source: No subscriptions were found.
ro: Nu au fost găsite abonamente.

# TransactionCreated
source: Transaction was created successfully.
ro: Tranzacția a fost creată cu succes.

# TransactionNotCreated
source: Transaction was not created successfully.
ro: Tranzacția nu a fost creată cu succes.

# NoTransactionsFound
source: No transactions were found.
ro: Nu au fost găsite tranzacții.

# TransactionNotFound
source: The transaction was not found.
ro: Tranzacția nu a fost găsită.

# NoEventsFound
source: No events were found.
ro: Nu au fost găsite evenimente.

# PlanHasSubscriptions
source: The plan has subscriptions and cannot be deleted.
ro: Planul are abonamente și nu poate fi șters.

# MaximumAllowedWebsitesReached
source: You have reached the maximum number of allowed websites.
ro: Ați atins numărul maxim de site-uri web permise.

# RegistrationDisabled
source: The registration is disabled.
ro: Înregistrarea este dezactivată.

# ReCaptchaKeyLong
source: The reCaptcha Key is too long.
ro: Cheia reCaptcha este prea lungă.

# GoogleClientIdLong
source: The Google Client Id is too long.
ro: Idul de client Google este prea lung.

# GoogleClientSecretLong
source: The Google Client Secret is too long.
ro: Secretul de client Google este prea lung.

# GoogleMapsKeyLong
source: The Google Maps key is too long.
ro: Cheia Google Maps este prea lungă.

# Ip2LocationLong
source: The Ip2Location key is too long.
ro: Cheia Ip2Location este prea lungă.

# CodeLong
source: The code is too long.
ro: Codul este prea lung.

# GoogleNotConfigured
source: The Google api is not configured.
ro: Api-ul la Google nu este configurat.

# AccessCodeNotGenerated
source: The access code wasn't generated successfully.
ro: Codul de acces nu a fost generat.

# WelcomeToSite
source: Welcome to Fechat
ro: Bine ați venit la Fechat

# LoginCredentials
source: Below are your login credentials
ro: Mai jos sunt datele dvs. de conectare

source: Best regards.
ro: Cu stima.

# NewUnreadMessage
source: A New Message Received
ro: Aveți mesaj necitit

# YouHaveNewUnreadMessage
source: You have received a new message on FeChat.
ro: Ați primit un mesaj nou pe FeChat.

source: Closing WebSocket connection
ro: Închiderea conexiunii WebSocket

# OptionsNotFound
source: App options were not found.
ro: Optiunile aplicatiei nu au fost gasite
